Repository: Hylbee/anchor-dynamic-url
Catalog: languages/anchor-dynamic-url-*.po
Languages: fr_fr

source: Unable to fetch changelog.
fr_fr: Impossible de récupérer le journal des modifications.

source: No changelog available.
fr_fr: Aucun journal des modifications disponible.

source: No release notes available.
fr_fr: Aucune note de version disponible.

source: Anchor Dynamic URL version %1$s is available. <a href="%2$s">Update now</a>.
fr_fr: Anchor Dynamic URL version %1$s est disponible. <a href="%2$s">Mettre à jour maintenant</a>.

source: Anchor (optional)
fr_fr: Ancre (optionnel)

source: e.g: contact-section
fr_fr: ex : section-contact

source: Adds #anchor to the URL. Updates automatically if the page slug changes.
fr_fr: Ajoute #ancre à l'URL. Se met à jour automatiquement si le slug de la page change.

source: View Changelog
fr_fr: Voir le journal des modifications

source: Configure Menus
fr_fr: Configurer les menus

source: Anchor Dynamic URL requires WordPress 5.0 or higher.
fr_fr: Anchor Dynamic URL nécessite WordPress 5.0 ou supérieur.

source: Anchor Dynamic URL requires PHP 7.4 or higher.
fr_fr: Anchor Dynamic URL nécessite PHP 7.4 ou supérieur.

source: Link Options
fr_fr: Options de lien

source: Open in new window
fr_fr: Ouvrir dans une nouvelle fenêtre

source: Add nofollow
fr_fr: Ajouter nofollow

source: Custom Attributes
fr_fr: Attributs personnalisés

source: key|value
fr_fr: clé|valeur

source: Target Anchor
fr_fr: Ancre cible

source: section-id
fr_fr: id-section

source: ID of the target element for scrolling (without #). Leave blank to use the normal link.
fr_fr: ID de l'élément cible pour le défilement (sans #). Laissez vide pour utiliser le lien normal.

source: ID Anchor Menu
fr_fr: ID Ancre Menu

source: Element ID
fr_fr: ID Élément

source: my-section
fr_fr: ma-section

source: Define an ID for this element that can be targeted from menus or other elements.
fr_fr: Définir un ID pour cet élément qui peut être ciblé depuis les menus ou autres éléments.
