Repository: Hylbee/anchor-dynamic-url
Catalog: languages/menu-anchor-manager-*.po
Languages: fr_fr

source: Anchor (optional)
fr_fr: Ancre (optionnel)

source: e.g: contact-section
fr_fr: ex : section-contact

source: Adds #anchor to the URL. Updates automatically if the page slug changes.
fr_fr: Ajoute #ancre à l'URL. Se met à jour automatiquement si le slug de la page change.

source: Add dynamic anchors to WordPress menu items with automatic URL updates
fr_fr: Ajoute des ancres dynamiques aux éléments de menu WordPress avec mise à jour automatique des URLs

source: View Changelog
fr_fr: Voir le changelog

source: Configure Menus
fr_fr: Configurer les menus

source: Menu Anchor Manager - Changelog
fr_fr: Menu Anchor Manager - Journal des modifications

source: Released: %s
fr_fr: Publié le : %s

source: Enhanced anchor sanitization with improved security
fr_fr: Amélioration de la validation des ancres avec sécurité renforcée

source: Case sensitivity preserved - anchors maintain original capitalization
fr_fr: Sensibilité à la casse préservée - les ancres conservent la capitalisation originale

source: Added comprehensive WordPress plugin headers
fr_fr: Ajout d'en-têtes WordPress complets pour le plugin

source: Protection against path traversal and query parameter injection
fr_fr: Protection contre l'injection de paramètres et la traversée de chemins

source: Strengthened input validation and character filtering
fr_fr: Validation des entrées et filtrage des caractères renforcés

source: Initial release with dynamic anchor management
fr_fr: Version initiale avec gestion dynamique des ancres

source: Domain-driven architecture with clean separation of concerns
fr_fr: Architecture domain-driven avec séparation claire des responsabilités

source: Automatic URL generation that updates when page slugs change
fr_fr: Génération automatique d'URLs qui se mettent à jour quand les slugs changent

source: Multi-language support (English, French, Spanish)
fr_fr: Support multi-langues (anglais, français, espagnol)

source: Security features with input sanitization and XSS protection
fr_fr: Fonctionnalités de sécurité avec validation des entrées et protection XSS
